# Tips and Trick Python Pandas 17

# Resampling Data Deret Waktu (Time Series Data)

# Import Module

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

# Buat Data Frame

- 365 = jumlah hari dalam 1 tahun
- 24 = jumlah jam dalam 1 hari
- `freq = 'H'` = per jam

Berbasis hour / jam

In [8]:
n_rows = 365 * 24
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df

                     col1  col2
2000-01-01 00:00:00    12    14
2000-01-01 01:00:00    19    12
2000-01-01 02:00:00     1    18
2000-01-01 03:00:00    11     5
2000-01-01 04:00:00     4     5
...                   ...   ...
2000-12-30 19:00:00    13     2
2000-12-30 20:00:00     7     5
2000-12-30 21:00:00    19    14
2000-12-30 22:00:00    18    14
2000-12-30 23:00:00     6    12

[8760 rows x 2 columns]

# Resampling Data dengan Interval Monthly

Menggunakan method = `resample()` dengan pemanggilan agregasi dengan `sum()`

`to_frame` untuk mempercantik tabel

Parameter resample() = `'M'` untuk Monthly

In [16]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7457
2000-02-29  6985
2000-03-31  7504
2000-04-30  7190
2000-05-31  7228
2000-06-30  6875
2000-07-31  7586
2000-08-31  7622
2000-09-30  6827
2000-10-31  7523
2000-11-30  7040
2000-12-31  7063

# Resampling Data dengan Interval Daily

Parameter resample() = `'D'` untuk Daily

In [17]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   210
2000-01-02   226
2000-01-03   216
2000-01-04   235
2000-01-05   223
...          ...
2000-12-26   278
2000-12-27   227
2000-12-28   272
2000-12-29   235
2000-12-30   257

[365 rows x 1 columns]